In [43]:
import pandas as pd

df = pd.read_csv('sales_data.csv')

df.head()

         Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0  2024-01-01       Phone         7  37300     CUST001   East       261100
1  2024-01-02  Headphones         4  15406     CUST002  North        61624
2  2024-01-03       Phone         2  21746     CUST003   West        43492
3  2024-01-04  Headphones         1  30895     CUST004   East        30895
4  2024-01-05      Laptop         8  39835     CUST005  North       318680

In [45]:
df.shape

(100, 7)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         100 non-null    object
 1   Product      100 non-null    object
 2   Quantity     100 non-null    int64
 3   Price        100 non-null    int64
 4   Customer_ID  100 non-null    object
 5   Region       100 non-null    object
 6   Total_Sales  100 non-null    int64
dtypes: int64(3), object(4)
memory usage: 5.6+ KB

In [49]:
df.describe()

         Quantity         Price    Total_Sales
count  100.000000    100.000000     100.000000
mean     4.780000  25808.510000  123650.480000
std      2.588163  13917.630242  100161.085275
min      1.000000   1308.000000    6540.000000
25%      2.750000  14965.250000   39517.500000
50%      5.000000  24192.000000   97955.500000
75%      7.000000  38682.250000  175792.500000
max      9.000000  49930.000000  373932.000000

In [51]:
df.isnull().sum()

Date           0
Product        0
Quantity       0
Price          0
Customer_ID    0
Region         0
Total_Sales    0
dtype: int64

In [53]:
df.fillna(0, inplace=True)

df.drop_duplicates(inplace=True)

df.isnull().sum()

Date           0
Product        0
Quantity       0
Price          0
Customer_ID    0
Region         0
Total_Sales    0
dtype: int64

In [55]:
if 'Total_Sales' not in df.columns:
    df['Total_Sales'] = df['Quantity'] * df['Price']

df.head()

         Date     Product  Quantity  Price Customer_ID Region  Total_Sales
0  2024-01-01       Phone         7  37300     CUST001   East       261100
1  2024-01-02  Headphones         4  15406     CUST002  North        61624
2  2024-01-03       Phone         2  21746     CUST003   West        43492
3  2024-01-04  Headphones         1  30895     CUST004   East        30895
4  2024-01-05      Laptop         8  39835     CUST005  North       318680

In [57]:
total_revenue = df['Total_Sales'].sum()

best_selling_product = df.groupby('Product')['Total_Sales'].sum().idxmax()

average_sales = df['Total_Sales'].mean()

total_revenue, best_selling_product, average_sales

(12365048, 'Laptop', 123650.48)

In [59]:
print("SALES DATA ANALYSIS REPORT")
print("-" * 40)

print(f"Total Revenue          : ₹{total_revenue:,.2f}")
print(f"Best-Selling Product   : {best_selling_product}")
print(f"Average Sales Value    : ₹{average_sales:,.2f}")

SALES DATA ANALYSIS REPORT
----------------------------------------
Total Revenue          : ₹12,365,048.00
Best-Selling Product   : Laptop
Average Sales Value    : ₹123,650.48

In [61]:
print("\n KEY INSIGHTS")
print("-" * 40)
print("• The dataset was cleaned by handling missing values and duplicates.")
print(f"• '{best_selling_product}' generated the highest revenue.")
print("• Average sales value helps understand customer purchase behavior.")

 KEY INSIGHTS
----------------------------------------
• The dataset was cleaned by handling missing values and duplicates.
• 'Laptop' generated the highest revenue.
• Average sales value helps understand customer purchase behavior.